<a href="https://colab.research.google.com/github/anew0m/AStudy_Pandas-basic/blob/main/study/09_Group_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 09_Group Data

## 15) groupby 활용하여 다양한 데이터 집계를 활용하기

In [4]:
import pandas as pd
import seaborn as sns

In [5]:
df = pd.DataFrame([])

In [6]:
df.groupby?

In [8]:
df = sns.load_dataset("mpg")
df

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [11]:
df.shape

(398, 9)

In [12]:
df.groupby(by = "origin")

In [13]:
df.groupby(by = "origin").size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [14]:
df["origin"].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [15]:
df.groupby(by = "origin").min()

         mpg  cylinders  ...  model_year                     name
origin                   ...
europe  16.2          4  ...          70              audi 100 ls
japan   18.0          3  ...          70              datsun 1200
usa      9.0          4  ...          70  amc ambassador brougham

[3 rows x 8 columns]

In [16]:
df.groupby(by = "origin").max()

         mpg  cylinders  ...  model_year                         name
origin                   ...
europe  44.3          6  ...          82             vw rabbit custom
japan   46.6          6  ...          82  toyouta corona mark ii (sw)
usa     39.0          8  ...          82           pontiac ventura sj

[3 rows x 8 columns]

In [17]:
df.groupby(by = "origin").mean()

              mpg  cylinders  ...  acceleration  model_year
origin                        ...
europe  27.891429   4.157143  ...     16.787143   75.814286
japan   30.450633   4.101266  ...     16.172152   77.443038
usa     20.083534   6.248996  ...     15.033735   75.610442

[3 rows x 7 columns]

In [18]:
df.groupby(by = "origin")['cylinders'].mean()

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [19]:
df.groupby(by = "origin")['cylinders'].median()

origin
europe    4
japan     4
usa       6
Name: cylinders, dtype: int64

In [20]:
df.pivot_table?

In [22]:
df.groupby?

In [25]:
df.groupby(['model_year', 'origin'])['cylinders'].mean()

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
Name: cylinders, dtype: float64

In [26]:
pd.DataFrame(df.groupby(['model_year', 'origin'])['cylinders'].mean()).head()

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000

In [27]:
df2 = pd.DataFrame(
	[[4, 7, 10],
	[5, 8, 11],
	[6, 9, 12]],
	index=[1, 2, 3],
	columns=['a', 'b', 'c']
)
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [28]:
df2.shift(1)

     a    b     c
1  NaN  NaN   NaN
2  4.0  7.0  10.0
3  5.0  8.0  11.0

In [29]:
df2.shift(-1)

     a    b     c
1  5.0  8.0  11.0
2  6.0  9.0  12.0
3  NaN  NaN   NaN

In [30]:
df2['a'].shift(1)

1    NaN
2    4.0
3    5.0
Name: a, dtype: float64

In [31]:
df2[['a', 'b']].shift(1)

     a    b
1  NaN  NaN
2  4.0  7.0
3  5.0  8.0

In [32]:
df

      mpg  cylinders  ...  origin                       name
0    18.0          8  ...     usa  chevrolet chevelle malibu
1    15.0          8  ...     usa          buick skylark 320
2    18.0          8  ...     usa         plymouth satellite
3    16.0          8  ...     usa              amc rebel sst
4    17.0          8  ...     usa                ford torino
..    ...        ...  ...     ...                        ...
393  27.0          4  ...     usa            ford mustang gl
394  44.0          4  ...  europe                  vw pickup
395  32.0          4  ...     usa              dodge rampage
396  28.0          4  ...     usa                ford ranger
397  31.0          4  ...     usa                 chevy s-10

[398 rows x 9 columns]

In [33]:
df["model_year"].rank(method = 'dense')

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
393    13.0
394    13.0
395    13.0
396    13.0
397    13.0
Name: model_year, Length: 398, dtype: float64

In [34]:
df["model_year"].rank(method = 'min')

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
       ...
393    368.0
394    368.0
395    368.0
396    368.0
397    368.0
Name: model_year, Length: 398, dtype: float64

In [36]:
df["model_year"].rank(method = 'min').value_counts()

86.0     40
245.0    36
183.0    34
368.0    31
153.0    30
339.0    29
281.0    29
310.0    29
1.0      29
217.0    28
58.0     28
30.0     28
126.0    27
Name: model_year, dtype: int64

In [37]:
df["model_year"].rank(method = 'max').value_counts()

125.0    40
280.0    36
216.0    34
398.0    31
182.0    30
367.0    29
309.0    29
338.0    29
29.0     29
244.0    28
85.0     28
57.0     28
152.0    27
Name: model_year, dtype: int64

In [38]:
df["model_year"].rank(method = 'max')

0       29.0
1       29.0
2       29.0
3       29.0
4       29.0
       ...
393    398.0
394    398.0
395    398.0
396    398.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [39]:
df["model_year"].rank(pct = True).head()

0    0.037688
1    0.037688
2    0.037688
3    0.037688
4    0.037688
Name: model_year, dtype: float64

In [40]:
df["model_year"].rank(method = 'first').head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [41]:
df["model_year"].rank(method = 'last').head()

KeyError: ignored

In [43]:
df2

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [42]:
df2.cumsum()

    a   b   c
1   4   7  10
2   9  15  21
3  15  24  33

* cumsum() 누적해서 더해줌

In [44]:
df2.cummax()

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [45]:
df2.cummin()

   a  b   c
1  4  7  10
2  4  7  10
3  4  7  10

In [46]:
df2.cumprod()

     a    b     c
1    4    7    10
2   20   56   110
3  120  504  1320